# 데이터 다루기 (1): Pandas + Seaborn (Titanic)

## 진행 방법
1. 각 코드 셀의 `TODO` 부분을 채우세요.
2. 필요 시 마크다운 셀의 질문에 답을 적으세요.
3. 마지막에는 간단한 **셀프 체크** 코드가 제공됩니다.

---

## 0. 환경 준비
- 필요한 라이브러리를 임포트합니다.
- Seaborn의 `titanic` 데이터셋을 로드합니다. (만약 로드 실패 시, 대체용 축약 데이터프레임을 생성합니다.)

In [2]:
import pandas as pd
import numpy as np
import seaborn as sns

# seaborn 내장 titanic 데이터셋 로드 (인터넷 연결/버전 이슈로 실패 시 사용 환경을 점검하세요)
titanic = sns.load_dataset("titanic")
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

## 1. 데이터 개요 확인
### Q1-1. 상위 5행을 미리보기 하세요 (`head`)
### Q1-2. 전체 구조와 결측치 정보를 확인하세요 (`info`)
### Q1-3. 수치형 통계 요약을 확인하세요 (`describe`)

In [3]:
# Q1-1 TODO: titanic 데이터의 상위 5행을 확인하세요.
# 예: titanic.____()
print(titanic.head(5))

# Q1-2 TODO: 데이터 구조 및 결측치 개요를 확인하세요.
# 예: titanic.____()
print(titanic.info())

# Q1-3 TODO: 수치형 컬럼의 기초 통계를 요약하세요.
# 예: titanic.____()
print(titanic.describe())

   survived  pclass     sex   age  sibsp  parch     fare embarked  class  \
0         0       3    male  22.0      1      0   7.2500        S  Third
1         1       1  female  38.0      1      0  71.2833        C  First
2         1       3  female  26.0      0      0   7.9250        S  Third
3         1       1  female  35.0      1      0  53.1000        S  First
4         0       3    male  35.0      0      0   8.0500        S  Third

     who  adult_male deck  embark_town alive  alone
0    man        True  NaN  Southampton    no  False
1  woman       False    C    Cherbourg   yes  False
2  woman       False  NaN  Southampton   yes   True
3  woman       False    C  Southampton   yes  False
4    man        True  NaN  Southampton    no   True
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB
None
         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

## 2. 컬럼 / 인덱스 / 선택
### Q2-1. 컬럼 이름을 확인하세요 (`columns`)
### Q2-2. `sex`, `age`, `fare` 컬럼만 선택해 상위 3행을 보세요
### Q2-3. `iloc`으로 0 ~ 4행, 0 ~ 2열을 선택하세요
### Q2-4. `loc`으로 인덱스 1~5 범위에서 `sex`, `age`만 선택하세요 (인덱스는 1부터 시작하도록 재설정)

In [9]:
# Q2-1 TODO: 컬럼 이름 보기
print(titanic.columns)

# # Q2-2 TODO: 특정 컬럼만 선택하여 상위 3행 보기
print(titanic[['sex', 'age', 'fare']].head(3))

# # 인덱스를 1부터 시작하도록 재설정
titanic.index = range(1, len(titanic) + 1)

# # Q2-3 TODO: iloc으로 0~4행, 0~2열 선택
print(titanic.iloc[0:4, 0:2])

# Q2-4 TODO: loc으로 인덱스 1~5 범위에서 sex, age 선택
print(titanic[['sex', 'age']].loc[1:5])

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')
      sex   age     fare
1    male  22.0   7.2500
2  female  38.0  71.2833
3  female  26.0   7.9250
   survived  pclass
1         0       3
2         1       1
3         1       3
4         1       1
      sex   age
1    male  22.0
2  female  38.0
3  female  26.0
4  female  35.0
5    male  35.0

## 3. 필터링 & 정렬
### Q3-1. 나이가 60 이상인 승객만 필터링하세요
### Q3-2. 여성(`sex == 'female'`) 이고 1등석(`pclass == 1`)인 승객만 필터링하세요
### Q3-3. 요금(`fare`)이 높은 순으로 5명만 보이세요 (`sort_values`)

In [25]:
# # Q3-1 TODO
print(titanic[titanic['age'] >= 60])

# # Q3-2 TODO
print(titanic[(titanic['sex'] == 'female') & (titanic['pclass'] == 1)])

# # Q3-3 TODO
print(titanic.sort_values('fare', ascending = False).head(5))

     survived  pclass     sex   age  sibsp  parch      fare embarked   class  \
34          0       2    male  66.0      0      0   10.5000        S  Second
55          0       1    male  65.0      0      1   61.9792        C   First
97          0       1    male  71.0      0      0   34.6542        C   First
117         0       3    male  70.5      0      0    7.7500        Q   Third
171         0       1    male  61.0      0      0   33.5000        S   First
253         0       1    male  62.0      0      0   26.5500        S   First
276         1       1  female  63.0      1      0   77.9583        S   First
281         0       3    male  65.0      0      0    7.7500        Q   Third
327         0       3    male  61.0      0      0    6.2375        S   Third
367         1       1  female  60.0      1      0   75.2500        C   First
439         0       1    male  64.0      1      4  263.0000        S   First
457         0       1    male  65.0      0      0   26.5500        S   First
484         1       3  female  63.0      0      0    9.5875        S   Third
494         0       1    male  71.0      0      0   49.5042        C   First
546         0       1    male  64.0      0      0   26.0000        S   First
556         0       1    male  62.0      0      0   26.5500        S   First
571         1       2    male  62.0      0      0   10.5000        S  Second
588         1       1    male  60.0      1      1   79.2000        C   First
626         0       1    male  61.0      0      0   32.3208        S   First
631         1       1    male  80.0      0      0   30.0000        S   First
673         0       2    male  70.0      0      0   10.5000        S  Second
685         0       2    male  60.0      1      1   39.0000        S  Second
695         0       1    male  60.0      0      0   26.5500        S   First
746         0       1    male  70.0      1      1   71.0000        S   First
830         1       1  female  62.0      0      0   80.0000      NaN   First
852         0       3    male  74.0      0      0    7.7750        S   Third

       who  adult_male deck  embark_town alive  alone
34     man        True  NaN  Southampton    no   True
55     man        True    B    Cherbourg    no  False
97     man        True    A    Cherbourg    no   True
117    man        True  NaN   Queenstown    no   True
171    man        True    B  Southampton    no   True
253    man        True    C  Southampton    no   True
276  woman       False    D  Southampton   yes  False
281    man        True  NaN   Queenstown    no   True
327    man        True  NaN  Southampton    no   True
367  woman       False    D    Cherbourg   yes  False
439    man        True    C  Southampton    no  False
457    man        True    E  Southampton    no   True
484  woman       False  NaN  Southampton   yes   True
494    man        True  NaN    Cherbourg    no   True
546    man        True  NaN  Southampton    no   True
556    man        True  NaN  Southampton    no   True
571    man        True  NaN  Southampton   yes   True
588    man        True    B    Cherbourg   yes  False
626    man        True    D  Southampton    no   True
631    man        True    A  Southampton   yes   True
673    man        True  NaN  Southampton    no   True
685    man        True  NaN  Southampton    no  False
695    man        True  NaN  Southampton    no   True
746    man        True    B  Southampton    no  False
830  woman       False    B          NaN   yes   True
852    man        True  NaN  Southampton    no   True
     survived  pclass     sex   age  sibsp  parch      fare embarked  class  \
2           1       1  female  38.0      1      0   71.2833        C  First
4           1       1  female  35.0      1      0   53.1000        S  First
12          1       1  female  58.0      0      0   26.5500        S  First
32          1       1  female   NaN      1      0  146.5208        C  First
53          1       1  female  49.0      1      0   76.7292        C  First
..        ...     ...     ...   ...    ...    ...       ...      ...    ...
857         1       1  female  45.0      1      1  164.8667        S  First
863         1       1  female  48.0      0      0   25.9292        S  First
872         1       1  female  47.0      1      1   52.5542        S  First
880         1       1  female  56.0      0      1   83.1583        C  First
888         1       1  female  19.0      0      0   30.0000        S  First

       who  adult_male deck  embark_town alive  alone
2    woman       False    C    Cherbourg   yes  False
4    woman       False    C  Southampton   yes  False
12   woman       False    C  Southampton   yes   True
32   woman       False    B    Cherbourg   yes  False
53   woman       False    D    Cherbourg   yes  False
..     ...         ...  ...          ...   ...    ...
857  woman       False  NaN  Southampton   yes  False
863  woman       False    D  Southampton   yes   True
872  woman       False    D  Southampton   yes  False
880  woman       False    C    Cherbourg   yes  False
888  woman       False    B  Southampton   yes   True

[94 rows x 15 columns]
     survived  pclass     sex   age  sibsp  parch      fare embarked  class  \
259         1       1  female  35.0      0      0  512.3292        C  First
738         1       1    male  35.0      0      0  512.3292        C  First
680         1       1    male  36.0      0      1  512.3292        C  First
89          1       1  female  23.0      3      2  263.0000        S  First
28          0       1    male  19.0      3      2  263.0000        S  First

       who  adult_male deck  embark_town alive  alone
259  woman       False  NaN    Cherbourg   yes   True
738    man        True    B    Cherbourg   yes   True
680    man        True    B    Cherbourg   yes  False
89   woman       False    C  Southampton   yes  False
28     man        True    C  Southampton    no  False

## 4. 결측치 처리
### Q4-1. `age` 결측치를 평균으로 채우세요 (`fillna`) - 원본 수정
### Q4-2. `embarked` 결측치를 최빈값으로 채우세요 (`mode()[0]`) - 원본 수정
### Q4-3. `age`가 결측인 행을 제거하세요 (`dropna(subset=[...])`) 대신, 여기서는 이미 Q4-1에서 채웠다면 예시로 `fare`의 결측이 있다면 제거해보세요

In [31]:
# Q4-1 TODO: age 평균으로 채우기
titanic['age'].fillna(titanic['age'].mean(), inplace = True)

# # Q4-2 TODO: embarked 최빈값으로 채우기
titanic['embarked'].fillna(titanic['embarked'].mode()[0], inplace = True)

# Q4-3 TODO: 특정 컬럼 결측치 행 제거
titanic.dropna(subset = ['fare'])

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,0,3,male,22.000000,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
2,1,1,female,38.000000,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
3,1,3,female,26.000000,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
4,1,1,female,35.000000,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
5,0,3,male,35.000000,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
887,0,2,male,27.000000,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
888,1,1,female,19.000000,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
889,0,3,female,29.699118,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
890,1,1,male,26.000000,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
891,0,3,male,32.000000,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

## 5. 파생변수 & 값 수정
### Q5-1. 나이가 18세 이상이면 `is_adult=True`, 아니면 False인 컬럼을 추가하세요
### Q5-2. `fare`가 0인 경우를 평균 요금으로 대체하세요 (`loc` 활용)
### Q5-3. 방금 만든 `is_adult` 컬럼을 삭제해보세요 (`drop`)

In [47]:
# Q5-1 TODO: is_adult 파생변수 추가
titanic['is_adult'] = titanic['age'] >= 18

# Q5-2 TODO: 요금이 0인 경우 평균 요금으로 대체
titanic.loc[titanic['fare'] == 0, 'fare'] = titanic['fare'].mean()

# Q5-3 TODO: is_adult 컬럼 삭제
titanic.drop(columns = ['is_adult'], inplace = True)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,0,3,male,22.000000,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
2,1,1,female,38.000000,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
3,1,3,female,26.000000,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
4,1,1,female,35.000000,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
5,0,3,male,35.000000,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
6,0,3,male,29.699118,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True
7,0,1,male,54.000000,0,0,51.8625,S,First,man,True,E,Southampton,no,True
8,0,3,male,2.000000,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False
9,1,3,female,27.000000,0,2,11.1333,S,Third,woman,False,NaN,Southampton,yes,False
10,1,2,female,14.000000,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False

## 6. 저장 & 불러오기 (옵션)
### Q6-1. 현재 DataFrame을 `titanic_clean.csv`로 저장하세요 (`to_csv`, `index=False`)
### Q6-2. 방금 저장한 파일을 다시 불러오세요 (`read_csv`)

In [56]:
# Q8-1 TODO: 저장
titanic.to_csv('titanic_clean.csv', index=False)

# Q8-2 TODO: 재로딩
titanic_clean = pd.read_csv('titanic_clean.csv')